Chenyiqian1234/gitLearning/324/Source/MC56F8367Reg.h
/* **************************  FLASH  ****************************** */
#define REG_FM_FMCLKD          (*((volatile UINT16 *)0x0000F400))
#define REG_FM_FMCR            (*((volatile UINT16 *)0x0000F401))
#define REG_FM_FMSECH          (*((volatile UINT16 *)0x0000F403))
#define REG_FM_FMSECL          (*((volatile UINT16 *)0x0000F404))
#define REG_FM_FMPROT          (*((volatile UINT16 *)0x0000F410))
#define REG_FM_FMPROTB         (*((volatile UINT16 *)0x0000F411))
#define REG_FM_FMUSTAT         (*((volatile UINT16 *)0x0000F413))
#define REG_FM_FMCMD           (*((volatile UINT16 *)0x0000F414))
#define REG_FM_FMOPT0          (*((volatile UINT16 *)0x0000F41A))
#define REG_FM_FMOPT1          (*((volatile UINT16 *)0x0000F41B))
#define REG_FM_FMOPT2          (*((volatile UINT16 *)0x0000F41C))
/* **************************   DEC1  ****************************** */
#define REG_DEC1_DECCR         (*((volatile UINT16 *)0x0000F190))
#define REG_DEC1_FIR           (*((volatile UINT16 *)0x0000F191))
#define REG_DEC1_WTR           (*((volatile UINT16 *)0x0000F192))
#define REG_DEC1_POSD          (*((volatile UINT16 *)0x0000F193))
#define REG_DEC1_POSDH         (*((volatile UINT16 *)0x0000F194))
#define REG_DEC1_REV           (*((volatile UINT16 *)0x0000F195))
#define REG_DEC1_REVH          (*((volatile UINT16 *)0x0000F196))
#define REG_DEC1_UPOS          (*((volatile UINT16 *)0x0000F197))
#define REG_DEC1_LPOS          (*((volatile UINT16 *)0x0000F198))
#define REG_DEC1_UPOSH         (*((volatile UINT16 *)0x0000F199))
#define REG_DEC1_LPOSH         (*((volatile UINT16 *)0x0000F19A))
#define REG_DEC1_UIR           (*((volatile UINT16 *)0x0000F19B))
#define REG_DEC1_LIR           (*((volatile UINT16 *)0x0000F19C))
#define REG_DEC1_IMR           (*((volatile UINT16 *)0x0000F19D))
/* **************************   DEC0  ****************************** */
#define REG_DEC0_DECCR         (*((volatile UINT16 *)0x0000F180))
#define REG_DEC0_FIR           (*((volatile UINT16 *)0x0000F181))
#define REG_DEC0_WTR           (*((volatile UINT16 *)0x0000F182))
#define REG_DEC0_POSD          (*((volatile UINT16 *)0x0000F183))
#define REG_DEC0_POSDH         (*((volatile UINT16 *)0x0000F184))
#define REG_DEC0_REV           (*((volatile UINT16 *)0x0000F185))
#define REG_DEC0_REVH          (*((volatile UINT16 *)0x0000F186))
#define REG_DEC0_UPOS          (*((volatile UINT16 *)0x0000F187))
#define REG_DEC0_LPOS          (*((volatile UINT16 *)0x0000F188))
#define REG_DEC0_UPOSH         (*((volatile UINT16 *)0x0000F189))
#define REG_DEC0_LPOSH         (*((volatile UINT16 *)0x0000F18A))
#define REG_DEC0_UIR           (*((volatile UINT16 *)0x0000F18B))
#define REG_DEC0_LIR           (*((volatile UINT16 *)0x0000F18C))
#define REG_DEC0_IMR           (*((volatile UINT16 *)0x0000F18D))
/* **************************   CAN1  ****************************** */
#define REG_CAN1_FCMCR         (*((volatile UINT16 *)0x0000FA00))
#define REG_CAN1_FCCTL0        (*((volatile UINT16 *)0x0000FA03))
#define REG_CAN1_FCCTL1        (*((volatile UINT16 *)0x0000FA04))
#define REG_CAN1_FCTMR         (*((volatile UINT16 *)0x0000FA05))
#define REG_CAN1_FCMAXMB       (*((volatile UINT16 *)0x0000FA06))
#define REG_CAN1_FCRXGMASK_H   (*((volatile UINT16 *)0x0000FA08))
#define REG_CAN1_FCRXGMASK_L   (*((volatile UINT16 *)0x0000FA09))
#define REG_CAN1_FCRX14MASK_H  (*((volatile UINT16 *)0x0000FA0A))
#define REG_CAN1_FCRX14MASK_L  (*((volatile UINT16 *)0x0000FA0B))
#define REG_CAN1_FCRX15MASK_H  (*((volatile UINT16 *)0x0000FA0C))
#define REG_CAN1_FCRX15MASK_L  (*((volatile UINT16 *)0x0000FA0D))
#define REG_CAN1_FCSTATUS      (*((volatile UINT16 *)0x0000FA10))
#define REG_CAN1_FCIMASK1      (*((volatile UINT16 *)0x0000FA11))
#define REG_CAN1_FCIFLAG1      (*((volatile UINT16 *)0x0000FA12))
#define REG_CAN1_FC_ERR_CNTRS  (*((volatile UINT16 *)0x0000FA13))
#define REG_CAN1_FCMB0_CTL     (*((volatile UINT16 *)0x0000FA40))
#define REG_CAN1_FCMB0_ID_H    (*((volatile UINT16 *)0x0000FA41))
#define REG_CAN1_FCMB0_ID_L    (*((volatile UINT16 *)0x0000FA42))
#define REG_CAN1_FCMB0_DATA0   (*((volatile UINT16 *)0x0000FA43))
#define REG_CAN1_FCMB0_DATA1   (*((volatile UINT16 *)0x0000FA44))
#define REG_CAN1_FCMB0_DATA2   (*((volatile UINT16 *)0x0000FA45))
#define REG_CAN1_FCMB0_DATA3   (*((volatile UINT16 *)0x0000FA46))
#define REG_CAN1_FCMB1_CTL     (*((volatile UINT16 *)0x0000FA48))
#define REG_CAN1_FCMB1_ID_H    (*((volatile UINT16 *)0x0000FA49))
#define REG_CAN1_FCMB1_ID_L    (*((volatile UINT16 *)0x0000FA4A))
#define REG_CAN1_FCMB1_DATA0   (*((volatile UINT16 *)0x0000FA4B))
#define REG_CAN1_FCMB1_DATA1   (*((volatile UINT16 *)0x0000FA4C))
#define REG_CAN1_FCMB1_DATA2   (*((volatile UINT16 *)0x0000FA4D))
#define REG_CAN1_FCMB1_DATA3   (*((volatile UINT16 *)0x0000FA4E))
#define REG_CAN1_FCMB2_CTL     (*((volatile UINT16 *)0x0000FA50))
#define REG_CAN1_FCMB2_ID_H    (*((volatile UINT16 *)0x0000FA51))
#define REG_CAN1_FCMB2_ID_L    (*((volatile UINT16 *)0x0000FA52))
#define REG_CAN1_FCMB2_DATA0   (*((volatile UINT16 *)0x0000FA53))
#define REG_CAN1_FCMB2_DATA1   (*((volatile UINT16 *)0x0000FA54))
#define REG_CAN1_FCMB2_DATA2   (*((volatile UINT16 *)0x0000FA55))
#define REG_CAN1_FCMB2_DATA3   (*((volatile UINT16 *)0x0000FA56))
#define REG_CAN1_FCMB3_CTL     (*((volatile UINT16 *)0x0000FA58))
#define REG_CAN1_FCMB3_ID_H    (*((volatile UINT16 *)0x0000FA59))
#define REG_CAN1_FCMB3_ID_L    (*((volatile UINT16 *)0x0000FA5A))
#define REG_CAN1_FCMB3_DATA0   (*((volatile UINT16 *)0x0000FA5B))
#define REG_CAN1_FCMB3_DATA1   (*((volatile UINT16 *)0x0000FA5C))
#define REG_CAN1_FCMB3_DATA2   (*((volatile UINT16 *)0x0000FA5D))
#define REG_CAN1_FCMB3_DATA3   (*((volatile UINT16 *)0x0000FA5E))
#define REG_CAN1_FCMB4_CTL     (*((volatile UINT16 *)0x0000FA60))
#define REG_CAN1_FCMB4_ID_H    (*((volatile UINT16 *)0x0000FA61))
#define REG_CAN1_FCMB4_ID_L    (*((volatile UINT16 *)0x0000FA62))
#define REG_CAN1_FCMB4_DATA0   (*((volatile UINT16 *)0x0000FA63))
#define REG_CAN1_FCMB4_DATA1   (*((volatile UINT16 *)0x0000FA64))
#define REG_CAN1_FCMB4_DATA2   (*((volatile UINT16 *)0x0000FA65))
#define REG_CAN1_FCMB4_DATA3   (*((volatile UINT16 *)0x0000FA66))
#define REG_CAN1_FCMB5_CTL     (*((volatile UINT16 *)0x0000FA68))
#define REG_CAN1_FCMB5_ID_H    (*((volatile UINT16 *)0x0000FA69))
#define REG_CAN1_FCMB5_ID_L    (*((volatile UINT16 *)0x0000FA6A))
#define REG_CAN1_FCMB5_DATA0   (*((volatile UINT16 *)0x0000FA6B))
#define REG_CAN1_FCMB5_DATA1   (*((volatile UINT16 *)0x0000FA6C))
#define REG_CAN1_FCMB5_DATA2   (*((volatile UINT16 *)0x0000FA6D))
#define REG_CAN1_FCMB5_DATA3   (*((volatile UINT16 *)0x0000FA6E))
#define REG_CAN1_FCMB6_CTL     (*((volatile UINT16 *)0x0000FA70))
#define REG_CAN1_FCMB6_ID_H    (*((volatile UINT16 *)0x0000FA71))
#define REG_CAN1_FCMB6_ID_L    (*((volatile UINT16 *)0x0000FA72))
#define REG_CAN1_FCMB6_DATA0   (*((volatile UINT16 *)0x0000FA73))
#define REG_CAN1_FCMB6_DATA1   (*((volatile UINT16 *)0x0000FA74))
#define REG_CAN1_FCMB6_DATA2   (*((volatile UINT16 *)0x0000FA75))
#define REG_CAN1_FCMB6_DATA3   (*((volatile UINT16 *)0x0000FA76))
#define REG_CAN1_FCMB7_CTL     (*((volatile UINT16 *)0x0000FA78))
#define REG_CAN1_FCMB7_ID_H    (*((volatile UINT16 *)0x0000FA79))
#define REG_CAN1_FCMB7_ID_L    (*((volatile UINT16 *)0x0000FA7A))
#define REG_CAN1_FCMB7_DATA0   (*((volatile UINT16 *)0x0000FA7B))
#define REG_CAN1_FCMB7_DATA1   (*((volatile UINT16 *)0x0000FA7C))
#define REG_CAN1_FCMB7_DATA2   (*((volatile UINT16 *)0x0000FA7D))
#define REG_CAN1_FCMB7_DATA3   (*((volatile UINT16 *)0x0000FA7E))
#define REG_CAN1_FCMB8_CTL     (*((volatile UINT16 *)0x0000FA80))
#define REG_CAN1_FCMB8_ID_H    (*((volatile UINT16 *)0x0000FA81))
#define REG_CAN1_FCMB8_ID_L    (*((volatile UINT16 *)0x0000FA82))
#define REG_CAN1_FCMB8_DATA0   (*((volatile UINT16 *)0x0000FA83))
#define REG_CAN1_FCMB8_DATA1   (*((volatile UINT16 *)0x0000FA84))
#define REG_CAN1_FCMB8_DATA2   (*((volatile UINT16 *)0x0000FA85))
#define REG_CAN1_FCMB8_DATA3   (*((volatile UINT16 *)0x0000FA86))
#define REG_CAN1_FCMB9_CTL     (*((volatile UINT16 *)0x0000FA88))
#define REG_CAN1_FCMB9_ID_H    (*((volatile UINT16 *)0x0000FA89))
#define REG_CAN1_FCMB9_ID_L    (*((volatile UINT16 *)0x0000FA8A))
#define REG_CAN1_FCMB9_DATA0   (*((volatile UINT16 *)0x0000FA8B))
#define REG_CAN1_FCMB9_DATA1   (*((volatile UINT16 *)0x0000FA8C))
#define REG_CAN1_FCMB9_DATA2   (*((volatile UINT16 *)0x0000FA8D))
#define REG_CAN1_FCMB9_DATA3   (*((volatile UINT16 *)0x0000FA8E))
#define REG_CAN1_FCMB10_CTL    (*((volatile UINT16 *)0x0000FA90))
#define REG_CAN1_FCMB10_ID_H   (*((volatile UINT16 *)0x0000FA91))
#define REG_CAN1_FCMB10_ID_L   (*((volatile UINT16 *)0x0000FA92))
#define REG_CAN1_FCMB10_DATA0  (*((volatile UINT16 *)0x0000FA93))
#define REG_CAN1_FCMB10_DATA1  (*((volatile UINT16 *)0x0000FA94))
#define REG_CAN1_FCMB10_DATA2  (*((volatile UINT16 *)0x0000FA95))
#define REG_CAN1_FCMB10_DATA3  (*((volatile UINT16 *)0x0000FA96))
#define REG_CAN1_FCMB11_CTL    (*((volatile UINT16 *)0x0000FA98))
#define REG_CAN1_FCMB11_ID_H   (*((volatile UINT16 *)0x0000FA99))
#define REG_CAN1_FCMB11_ID_L   (*((volatile UINT16 *)0x0000FA9A))
#define REG_CAN1_FCMB11_DATA0  (*((volatile UINT16 *)0x0000FA9B))
#define REG_CAN1_FCMB11_DATA1  (*((volatile UINT16 *)0x0000FA9C))
#define REG_CAN1_FCMB11_DATA2  (*((volatile UINT16 *)0x0000FA9D))
#define REG_CAN1_FCMB11_DATA3  (*((volatile UINT16 *)0x0000FA9E))
#define REG_CAN1_FCMB12_CTL    (*((volatile UINT16 *)0x0000FAA0))
#define REG_CAN1_FCMB12_ID_H   (*((volatile UINT16 *)0x0000FAA1))
#define REG_CAN1_FCMB12_ID_L   (*((volatile UINT16 *)0x0000FAA2))
#define REG_CAN1_FCMB12_DATA0  (*((volatile UINT16 *)0x0000FAA3))
#define REG_CAN1_FCMB12_DATA1  (*((volatile UINT16 *)0x0000FAA4))
#define REG_CAN1_FCMB12_DATA2  (*((volatile UINT16 *)0x0000FAA5))
#define REG_CAN1_FCMB12_DATA3  (*((volatile UINT16 *)0x0000FAA6))
#define REG_CAN1_FCMB13_CTL    (*((volatile UINT16 *)0x0000FAA8))
#define REG_CAN1_FCMB13_ID_H   (*((volatile UINT16 *)0x0000FAA9))
#define REG_CAN1_FCMB13_ID_L   (*((volatile UINT16 *)0x0000FAAA))
#define REG_CAN1_FCMB13_DATA0  (*((volatile UINT16 *)0x0000FAAB))
#define REG_CAN1_FCMB13_DATA1  (*((volatile UINT16 *)0x0000FAAC))
#define REG_CAN1_FCMB13_DATA2  (*((volatile UINT16 *)0x0000FAAD))
#define REG_CAN1_FCMB13_DATA3  (*((volatile UINT16 *)0x0000FAAE))
#define REG_CAN1_FCMB14_CTL    (*((volatile UINT16 *)0x0000FAB0))
#define REG_CAN1_FCMB14_ID_H   (*((volatile UINT16 *)0x0000FAB1))
#define REG_CAN1_FCMB14_ID_L   (*((volatile UINT16 *)0x0000FAB2))
#define REG_CAN1_FCMB14_DATA0  (*((volatile UINT16 *)0x0000FAB3))
#define REG_CAN1_FCMB14_DATA1  (*((volatile UINT16 *)0x0000FAB4))
#define REG_CAN1_FCMB14_DATA2  (*((volatile UINT16 *)0x0000FAB5))
#define REG_CAN1_FCMB14_DATA3  (*((volatile UINT16 *)0x0000FAB6))
#define REG_CAN1_FCMB15_CTL    (*((volatile UINT16 *)0x0000FAB8))
#define REG_CAN1_FCMB15_ID_H   (*((volatile UINT16 *)0x0000FAB9))
#define REG_CAN1_FCMB15_ID_L   (*((volatile UINT16 *)0x0000FABA))
#define REG_CAN1_FCMB15_DATA0  (*((volatile UINT16 *)0x0000FABB))
#define REG_CAN1_FCMB15_DATA1  (*((volatile UINT16 *)0x0000FABC))
#define REG_CAN1_FCMB15_DATA2  (*((volatile UINT16 *)0x0000FABD))
#define REG_CAN1_FCMB15_DATA3  (*((volatile UINT16 *)0x0000FABE))
/* ***************************   CAN0  ***************************** */
#define REG_CAN0_FCMCR         (*((volatile UINT16 *)0x0000F800))
#define REG_CAN0_FCCTL0        (*((volatile UINT16 *)0x0000F803))
#define REG_CAN0_FCCTL1        (*((volatile UINT16 *)0x0000F804))
#define REG_CAN0_FCTMR         (*((volatile UINT16 *)0x0000F805))
#define REG_CAN0_FCMAXMB       (*((volatile UINT16 *)0x0000F806))
#define REG_CAN0_FCRXGMASK_H   (*((volatile UINT16 *)0x0000F808))
#define REG_CAN0_FCRXGMASK_L   (*((volatile UINT16 *)0x0000F809))
#define REG_CAN0_FCRX14MASK_H  (*((volatile UINT16 *)0x0000F80A))
#define REG_CAN0_FCRX14MASK_L  (*((volatile UINT16 *)0x0000F80B))
#define REG_CAN0_FCRX15MASK_H  (*((volatile UINT16 *)0x0000F80C))
#define REG_CAN0_FCRX15MASK_L  (*((volatile UINT16 *)0x0000F80D))
#define REG_CAN0_FCSTATUS      (*((volatile UINT16 *)0x0000F810))
#define REG_CAN0_FCIMASK1      (*((volatile UINT16 *)0x0000F811))
#define REG_CAN0_FCIFLAG1      (*((volatile UINT16 *)0x0000F812))
#define REG_CAN0_FC_ERR_CNTRS  (*((volatile UINT16 *)0x0000F813))
#define REG_CAN0_FCMB0_CTL     (*((volatile UINT16 *)0x0000F840))
#define REG_CAN0_FCMB0_ID_H    (*((volatile UINT16 *)0x0000F841))
#define REG_CAN0_FCMB0_ID_L    (*((volatile UINT16 *)0x0000F842))
#define REG_CAN0_FCMB0_DATA0   (*((volatile UINT16 *)0x0000F843))
#define REG_CAN0_FCMB0_DATA1   (*((volatile UINT16 *)0x0000F844))
#define REG_CAN0_FCMB0_DATA2   (*((volatile UINT16 *)0x0000F845))
#define REG_CAN0_FCMB0_DATA3   (*((volatile UINT16 *)0x0000F846))
#define REG_CAN0_FCMB1_CTL     (*((volatile UINT16 *)0x0000F848))
#define REG_CAN0_FCMB1_ID_H    (*((volatile UINT16 *)0x0000F849))
#define REG_CAN0_FCMB1_ID_L    (*((volatile UINT16 *)0x0000F84A))
#define REG_CAN0_FCMB1_DATA0   (*((volatile UINT16 *)0x0000F84B))
#define REG_CAN0_FCMB1_DATA1   (*((volatile UINT16 *)0x0000F84C))
#define REG_CAN0_FCMB1_DATA2   (*((volatile UINT16 *)0x0000F84D))
#define REG_CAN0_FCMB1_DATA3   (*((volatile UINT16 *)0x0000F84E))
#define REG_CAN0_FCMB2_CTL     (*((volatile UINT16 *)0x0000F850))
#define REG_CAN0_FCMB2_ID_H    (*((volatile UINT16 *)0x0000F851))
#define REG_CAN0_FCMB2_ID_L    (*((volatile UINT16 *)0x0000F852))
#define REG_CAN0_FCMB2_DATA0   (*((volatile UINT16 *)0x0000F853))
#define REG_CAN0_FCMB2_DATA1   (*((volatile UINT16 *)0x0000F854))
#define REG_CAN0_FCMB2_DATA2   (*((volatile UINT16 *)0x0000F855))
#define REG_CAN0_FCMB2_DATA3   (*((volatile UINT16 *)0x0000F856))
#define REG_CAN0_FCMB3_CTL     (*((volatile UINT16 *)0x0000F858))
#define REG_CAN0_FCMB3_ID_H    (*((volatile UINT16 *)0x0000F859))
#define REG_CAN0_FCMB3_ID_L    (*((volatile UINT16 *)0x0000F85A))
#define REG_CAN0_FCMB3_DATA0   (*((volatile UINT16 *)0x0000F85B))
#define REG_CAN0_FCMB3_DATA1   (*((volatile UINT16 *)0x0000F85C))
#define REG_CAN0_FCMB3_DATA2   (*((volatile UINT16 *)0x0000F85D))
#define REG_CAN0_FCMB3_DATA3   (*((volatile UINT16 *)0x0000F85E))
#define REG_CAN0_FCMB4_CTL     (*((volatile UINT16 *)0x0000F860))
#define REG_CAN0_FCMB4_ID_H    (*((volatile UINT16 *)0x0000F861))
#define REG_CAN0_FCMB4_ID_L    (*((volatile UINT16 *)0x0000F862))
#define REG_CAN0_FCMB4_DATA0   (*((volatile UINT16 *)0x0000F863))
#define REG_CAN0_FCMB4_DATA1   (*((volatile UINT16 *)0x0000F864))
#define REG_CAN0_FCMB4_DATA2   (*((volatile UINT16 *)0x0000F865))
#define REG_CAN0_FCMB4_DATA3   (*((volatile UINT16 *)0x0000F866))
#define REG_CAN0_FCMB5_CTL     (*((volatile UINT16 *)0x0000F868))
#define REG_CAN0_FCMB5_ID_H    (*((volatile UINT16 *)0x0000F869))
#define REG_CAN0_FCMB5_ID_L    (*((volatile UINT16 *)0x0000F86A))
#define REG_CAN0_FCMB5_DATA0   (*((volatile UINT16 *)0x0000F86B))
#define REG_CAN0_FCMB5_DATA1   (*((volatile UINT16 *)0x0000F86C))
#define REG_CAN0_FCMB5_DATA2   (*((volatile UINT16 *)0x0000F86D))
#define REG_CAN0_FCMB5_DATA3   (*((volatile UINT16 *)0x0000F86E))
#define REG_CAN0_FCMB6_CTL     (*((volatile UINT16 *)0x0000F870))
#define REG_CAN0_FCMB6_ID_H    (*((volatile UINT16 *)0x0000F871))
#define REG_CAN0_FCMB6_ID_L    (*((volatile UINT16 *)0x0000F872))
#define REG_CAN0_FCMB6_DATA0   (*((volatile UINT16 *)0x0000F873))
#define REG_CAN0_FCMB6_DATA1   (*((volatile UINT16 *)0x0000F874))
#define REG_CAN0_FCMB6_DATA2   (*((volatile UINT16 *)0x0000F875))
#define REG_CAN0_FCMB6_DATA3   (*((volatile UINT16 *)0x0000F876))
#define REG_CAN0_FCMB7_CTL     (*((volatile UINT16 *)0x0000F878))
#define REG_CAN0_FCMB7_ID_H    (*((volatile UINT16 *)0x0000F879))
#define REG_CAN0_FCMB7_ID_L    (*((volatile UINT16 *)0x0000F87A))
#define REG_CAN0_FCMB7_DATA0   (*((volatile UINT16 *)0x0000F87B))
#define REG_CAN0_FCMB7_DATA1   (*((volatile UINT16 *)0x0000F87C))
#define REG_CAN0_FCMB7_DATA2   (*((volatile UINT16 *)0x0000F87D))
#define REG_CAN0_FCMB7_DATA3   (*((volatile UINT16 *)0x0000F87E))
#define REG_CAN0_FCMB8_CTL     (*((volatile UINT16 *)0x0000F880))
#define REG_CAN0_FCMB8_ID_H    (*((volatile UINT16 *)0x0000F881))
#define REG_CAN0_FCMB8_ID_L    (*((volatile UINT16 *)0x0000F882))
#define REG_CAN0_FCMB8_DATA0   (*((volatile UINT16 *)0x0000F883))
#define REG_CAN0_FCMB8_DATA1   (*((volatile UINT16 *)0x0000F884))
#define REG_CAN0_FCMB8_DATA2   (*((volatile UINT16 *)0x0000F885))
#define REG_CAN0_FCMB8_DATA3   (*((volatile UINT16 *)0x0000F886))
#define REG_CAN0_FCMB9_CTL     (*((volatile UINT16 *)0x0000F888))
#define REG_CAN0_FCMB9_ID_H    (*((volatile UINT16 *)0x0000F889))
#define REG_CAN0_FCMB9_ID_L    (*((volatile UINT16 *)0x0000F88A))
#define REG_CAN0_FCMB9_DATA0   (*((volatile UINT16 *)0x0000F88B))
#define REG_CAN0_FCMB9_DATA1   (*((volatile UINT16 *)0x0000F88C))
#define REG_CAN0_FCMB9_DATA2   (*((volatile UINT16 *)0x0000F88D))
#define REG_CAN0_FCMB9_DATA3   (*((volatile UINT16 *)0x0000F88E))
#define REG_CAN0_FCMB10_CTL    (*((volatile UINT16 *)0x0000F890))
#define REG_CAN0_FCMB10_ID_H   (*((volatile UINT16 *)0x0000F891))
#define REG_CAN0_FCMB10_ID_L   (*((volatile UINT16 *)0x0000F892))
#define REG_CAN0_FCMB10_DATA0  (*((volatile UINT16 *)0x0000F893))
#define REG_CAN0_FCMB10_DATA1  (*((volatile UINT16 *)0x0000F894))
#define REG_CAN0_FCMB10_DATA2  (*((volatile UINT16 *)0x0000F895))
#define REG_CAN0_FCMB10_DATA3  (*((volatile UINT16 *)0x0000F896))
#define REG_CAN0_FCMB11_CTL    (*((volatile UINT16 *)0x0000F898))
#define REG_CAN0_FCMB11_ID_H   (*((volatile UINT16 *)0x0000F899))
#define REG_CAN0_FCMB11_ID_L   (*((volatile UINT16 *)0x0000F89A))
#define REG_CAN0_FCMB11_DATA0  (*((volatile UINT16 *)0x0000F89B))
#define REG_CAN0_FCMB11_DATA1  (*((volatile UINT16 *)0x0000F89C))
#define REG_CAN0_FCMB11_DATA2  (*((volatile UINT16 *)0x0000F89D))
#define REG_CAN0_FCMB11_DATA3  (*((volatile UINT16 *)0x0000F89E))
#define REG_CAN0_FCMB12_CTL    (*((volatile UINT16 *)0x0000F8A0))
#define REG_CAN0_FCMB12_ID_H   (*((volatile UINT16 *)0x0000F8A1))
#define REG_CAN0_FCMB12_ID_L   (*((volatile UINT16 *)0x0000F8A2))
#define REG_CAN0_FCMB12_DATA0  (*((volatile UINT16 *)0x0000F8A3))
#define REG_CAN0_FCMB12_DATA1  (*((volatile UINT16 *)0x0000F8A4))
#define REG_CAN0_FCMB12_DATA2  (*((volatile UINT16 *)0x0000F8A5))
#define REG_CAN0_FCMB12_DATA3  (*((volatile UINT16 *)0x0000F8A6))
#define REG_CAN0_FCMB13_CTL    (*((volatile UINT16 *)0x0000F8A8))
#define REG_CAN0_FCMB13_ID_H   (*((volatile UINT16 *)0x0000F8A9))
#define REG_CAN0_FCMB13_ID_L   (*((volatile UINT16 *)0x0000F8AA))
#define REG_CAN0_FCMB13_DATA0  (*((volatile UINT16 *)0x0000F8AB))
#define REG_CAN0_FCMB13_DATA1  (*((volatile UINT16 *)0x0000F8AC))
#define REG_CAN0_FCMB13_DATA2  (*((volatile UINT16 *)0x0000F8AD))
#define REG_CAN0_FCMB13_DATA3  (*((volatile UINT16 *)0x0000F8AE))
#define REG_CAN0_FCMB14_CTL    (*((volatile UINT16 *)0x0000F8B0))
#define REG_CAN0_FCMB14_ID_H   (*((volatile UINT16 *)0x0000F8B1))
#define REG_CAN0_FCMB14_ID_L   (*((volatile UINT16 *)0x0000F8B2))
#define REG_CAN0_FCMB14_DATA0  (*((volatile UINT16 *)0x0000F8B3))
#define REG_CAN0_FCMB14_DATA1  (*((volatile UINT16 *)0x0000F8B4))
#define REG_CAN0_FCMB14_DATA2  (*((volatile UINT16 *)0x0000F8B5))
#define REG_CAN0_FCMB14_DATA3  (*((volatile UINT16 *)0x0000F8B6))
#define REG_CAN0_FCMB15_CTL    (*((volatile UINT16 *)0x0000F8B8))
#define REG_CAN0_FCMB15_ID_H   (*((volatile UINT16 *)0x0000F8B9))
#define REG_CAN0_FCMB15_ID_L   (*((volatile UINT16 *)0x0000F8BA))
#define REG_CAN0_FCMB15_DATA0  (*((volatile UINT16 *)0x0000F8BB))
#define REG_CAN0_FCMB15_DATA1  (*((volatile UINT16 *)0x0000F8BC))
#define REG_CAN0_FCMB15_DATA2  (*((volatile UINT16 *)0x0000F8BD))
#define REG_CAN0_FCMB15_DATA3  (*((volatile UINT16 *)0x0000F8BE))
/* **************************   ADCA  ****************************** */
#define REG_ADCA_ADCTL1        (*((volatile UINT16 *)0x0000F200))
#define REG_ADCA_ADCTL2        (*((volatile UINT16 *)0x0000F201))
#define REG_ADCA_ADZCC         (*((volatile UINT16 *)0x0000F202))
#define REG_ADCA_ADLST1        (*((volatile UINT16 *)0x0000F203))
#define REG_ADCA_ADLST2        (*((volatile UINT16 *)0x0000F204))
#define REG_ADCA_ADSDIS        (*((volatile UINT16 *)0x0000F205))
#define REG_ADCA_ADSTAT        (*((volatile UINT16 *)0x0000F206))
#define REG_ADCA_ADLSTAT       (*((volatile UINT16 *)0x0000F207))
#define REG_ADCA_ADZCSTAT      (*((volatile UINT16 *)0x0000F208))
#define REG_ADCA_ADRSLT0       (*((volatile UINT16 *)0x0000F209))
#define REG_ADCA_ADRSLT1       (*((volatile UINT16 *)0x0000F20A))
#define REG_ADCA_ADRSLT2       (*((volatile UINT16 *)0x0000F20B))
#define REG_ADCA_ADRSLT3       (*((volatile UINT16 *)0x0000F20C))
#define REG_ADCA_ADRSLT4       (*((volatile UINT16 *)0x0000F20D))
#define REG_ADCA_ADRSLT5       (*((volatile UINT16 *)0x0000F20E))
#define REG_ADCA_ADRSLT6       (*((volatile UINT16 *)0x0000F20F))
#define REG_ADCA_ADRSLT7       (*((volatile UINT16 *)0x0000F210))
#define REG_ADCA_ADLLMT0       (*((volatile UINT16 *)0x0000F211))
#define REG_ADCA_ADLLMT1       (*((volatile UINT16 *)0x0000F212))
#define REG_ADCA_ADLLMT2       (*((volatile UINT16 *)0x0000F213))
#define REG_ADCA_ADLLMT3       (*((volatile UINT16 *)0x0000F214))
#define REG_ADCA_ADLLMT4       (*((volatile UINT16 *)0x0000F215))
#define REG_ADCA_ADLLMT5       (*((volatile UINT16 *)0x0000F216))
#define REG_ADCA_ADLLMT6       (*((volatile UINT16 *)0x0000F217))
#define REG_ADCA_ADLLMT7       (*((volatile UINT16 *)0x0000F218))
#define REG_ADCA_ADHLMT0       (*((volatile UINT16 *)0x0000F219))
#define REG_ADCA_ADHLMT1       (*((volatile UINT16 *)0x0000F21A))
#define REG_ADCA_ADHLMT2       (*((volatile UINT16 *)0x0000F21B))
#define REG_ADCA_ADHLMT3       (*((volatile UINT16 *)0x0000F21C))
#define REG_ADCA_ADHLMT4       (*((volatile UINT16 *)0x0000F21D))
#define REG_ADCA_ADHLMT5       (*((volatile UINT16 *)0x0000F21E))
#define REG_ADCA_ADHLMT6       (*((volatile UINT16 *)0x0000F21F))
#define REG_ADCA_ADHLMT7       (*((volatile UINT16 *)0x0000F220))
#define REG_ADCA_ADOFS0        (*((volatile UINT16 *)0x0000F221))
#define REG_ADCA_ADOFS1        (*((volatile UINT16 *)0x0000F222))
#define REG_ADCA_ADOFS2        (*((volatile UINT16 *)0x0000F223))
#define REG_ADCA_ADOFS3        (*((volatile UINT16 *)0x0000F224))
#define REG_ADCA_ADOFS4        (*((volatile UINT16 *)0x0000F225))
#define REG_ADCA_ADOFS5        (*((volatile UINT16 *)0x0000F226))
#define REG_ADCA_ADOFS6        (*((volatile UINT16 *)0x0000F227))
#define REG_ADCA_ADOFS7        (*((volatile UINT16 *)0x0000F228))
#define REG_ADCA_ADPOWER       (*((volatile UINT16 *)0x0000F229))
#define REG_ADCA_ADCAL         (*((volatile UINT16 *)0x0000F22A))
/* **************************   ADCB  ****************************** */
#define REG_ADCB_ADCTL1        (*((volatile UINT16 *)0x0000F240))
#define REG_ADCB_ADCTL2        (*((volatile UINT16 *)0x0000F241))
#define REG_ADCB_ADZCC         (*((volatile UINT16 *)0x0000F242))
#define REG_ADCB_ADLST1        (*((volatile UINT16 *)0x0000F243))
#define REG_ADCB_ADLST2        (*((volatile UINT16 *)0x0000F244))
#define REG_ADCB_ADSDIS        (*((volatile UINT16 *)0x0000F245))
#define REG_ADCB_ADSTAT        (*((volatile UINT16 *)0x0000F246))
#define REG_ADCB_ADLSTAT       (*((volatile UINT16 *)0x0000F247))
#define REG_ADCB_ADZCSTAT      (*((volatile UINT16 *)0x0000F248))
#define REG_ADCB_ADRSLT0       (*((volatile UINT16 *)0x0000F249))
#define REG_ADCB_ADRSLT1       (*((volatile UINT16 *)0x0000F24A))
#define REG_ADCB_ADRSLT2       (*((volatile UINT16 *)0x0000F24B))
#define REG_ADCB_ADRSLT3       (*((volatile UINT16 *)0x0000F24C))
#define REG_ADCB_ADRSLT4       (*((volatile UINT16 *)0x0000F24D))
#define REG_ADCB_ADRSLT5       (*((volatile UINT16 *)0x0000F24E))
#define REG_ADCB_ADRSLT6       (*((volatile UINT16 *)0x0000F24F))
#define REG_ADCB_ADRSLT7       (*((volatile UINT16 *)0x0000F250))
#define REG_ADCB_ADLLMT0       (*((volatile UINT16 *)0x0000F251))
#define REG_ADCB_ADLLMT1       (*((volatile UINT16 *)0x0000F252))
#define REG_ADCB_ADLLMT2       (*((volatile UINT16 *)0x0000F253))
