Chenyiqian1234/gitLearning/324/Source/MC56F8367Reg.h
#define REG_ADCB_ADLLMT3       (*((volatile UINT16 *)0x0000F254))
#define REG_ADCB_ADLLMT4       (*((volatile UINT16 *)0x0000F255))
#define REG_ADCB_ADLLMT5       (*((volatile UINT16 *)0x0000F256))
#define REG_ADCB_ADLLMT6       (*((volatile UINT16 *)0x0000F257))
#define REG_ADCB_ADLLMT7       (*((volatile UINT16 *)0x0000F258))
#define REG_ADCB_ADHLMT0       (*((volatile UINT16 *)0x0000F259))
#define REG_ADCB_ADHLMT1       (*((volatile UINT16 *)0x0000F25A))
#define REG_ADCB_ADHLMT2       (*((volatile UINT16 *)0x0000F25B))
#define REG_ADCB_ADHLMT3       (*((volatile UINT16 *)0x0000F25C))
#define REG_ADCB_ADHLMT4       (*((volatile UINT16 *)0x0000F25D))
#define REG_ADCB_ADHLMT5       (*((volatile UINT16 *)0x0000F25E))
#define REG_ADCB_ADHLMT6       (*((volatile UINT16 *)0x0000F25F))
#define REG_ADCB_ADHLMT7       (*((volatile UINT16 *)0x0000F260))
#define REG_ADCB_ADOFS0        (*((volatile UINT16 *)0x0000F261))
#define REG_ADCB_ADOFS1        (*((volatile UINT16 *)0x0000F262))
#define REG_ADCB_ADOFS2        (*((volatile UINT16 *)0x0000F263))
#define REG_ADCB_ADOFS3        (*((volatile UINT16 *)0x0000F264))
#define REG_ADCB_ADOFS4        (*((volatile UINT16 *)0x0000F265))
#define REG_ADCB_ADOFS5        (*((volatile UINT16 *)0x0000F266))
#define REG_ADCB_ADOFS6        (*((volatile UINT16 *)0x0000F267))
#define REG_ADCB_ADOFS7        (*((volatile UINT16 *)0x0000F268))
#define REG_ADCB_ADPOWER       (*((volatile UINT16 *)0x0000F269))
#define REG_ADCB_ADCAL         (*((volatile UINT16 *)0x0000F26A))
/* **************************   SPI0  ****************************** */
#define REG_SPI0_SPSCR         (*((volatile UINT16 *)0x0000F2A0))
#define REG_SPI0_SPDSR         (*((volatile UINT16 *)0x0000F2A1))
#define REG_SPI0_SPDRR         (*((volatile UINT16 *)0x0000F2A2))
#define REG_SPI0_SPDTR         (*((volatile UINT16 *)0x0000F2A3))
/* **************************   SPI1  ****************************** */
#define REG_SPI1_SPSCR         (*((volatile UINT16 *)0x0000F2B0))
#define REG_SPI1_SPDSR         (*((volatile UINT16 *)0x0000F2B1))
#define REG_SPI1_SPDRR         (*((volatile UINT16 *)0x0000F2B2))
#define REG_SPI1_SPDTR         (*((volatile UINT16 *)0x0000F2B3))
/* ************************** TIMERD0 ****************************** */
#define REG_TIMERD0_CMP1       (*((volatile UINT16 *)0x0000F100))
#define REG_TIMERD0_CMP2       (*((volatile UINT16 *)0x0000F101))
#define REG_TIMERD0_CAP        (*((volatile UINT16 *)0x0000F102))
#define REG_TIMERD0_LOAD       (*((volatile UINT16 *)0x0000F103))
#define REG_TIMERD0_HOLD       (*((volatile UINT16 *)0x0000F104))
#define REG_TIMERD0_CNTR       (*((volatile UINT16 *)0x0000F105))
#define REG_TIMERD0_CTRL       (*((volatile UINT16 *)0x0000F106))
#define REG_TIMERD0_SCR        (*((volatile UINT16 *)0x0000F107))
#define REG_TIMERD0_CMPLD1     (*((volatile UINT16 *)0x0000F108))
#define REG_TIMERD0_CMPLD2     (*((volatile UINT16 *)0x0000F109))
#define REG_TIMERD0_COMSCR     (*((volatile UINT16 *)0x0000F10A))
/* ************************** TIMERD1 ****************************** */
#define REG_TIMERD1_CMP1       (*((volatile UINT16 *)0x0000F110))
#define REG_TIMERD1_CMP2       (*((volatile UINT16 *)0x0000F111))
#define REG_TIMERD1_CAP        (*((volatile UINT16 *)0x0000F112))
#define REG_TIMERD1_LOAD       (*((volatile UINT16 *)0x0000F113))
#define REG_TIMERD1_HOLD       (*((volatile UINT16 *)0x0000F114))
#define REG_TIMERD1_CNTR       (*((volatile UINT16 *)0x0000F115))
#define REG_TIMERD1_CTRL       (*((volatile UINT16 *)0x0000F116))
#define REG_TIMERD1_SCR        (*((volatile UINT16 *)0x0000F117))
#define REG_TIMERD1_CMPLD1     (*((volatile UINT16 *)0x0000F118))
#define REG_TIMERD1_CMPLD2     (*((volatile UINT16 *)0x0000F119))
#define REG_TIMERD1_COMSCR     (*((volatile UINT16 *)0x0000F11A))
/* ************************** TIMERD2 ****************************** */
#define REG_TIMERD2_CMP1       (*((volatile UINT16 *)0x0000F120))
#define REG_TIMERD2_CMP2       (*((volatile UINT16 *)0x0000F121))
#define REG_TIMERD2_CAP        (*((volatile UINT16 *)0x0000F122))
#define REG_TIMERD2_LOAD       (*((volatile UINT16 *)0x0000F123))
#define REG_TIMERD2_HOLD       (*((volatile UINT16 *)0x0000F124))
#define REG_TIMERD2_CNTR       (*((volatile UINT16 *)0x0000F125))
#define REG_TIMERD2_CTRL       (*((volatile UINT16 *)0x0000F126))
#define REG_TIMERD2_SCR        (*((volatile UINT16 *)0x0000F127))
#define REG_TIMERD2_CMPLD1     (*((volatile UINT16 *)0x0000F128))
#define REG_TIMERD2_CMPLD2     (*((volatile UINT16 *)0x0000F129))
#define REG_TIMERD2_COMSCR     (*((volatile UINT16 *)0x0000F12A))
/* ************************** TIMERD3 ****************************** */
#define REG_TIMERD3_CMP1       (*((volatile UINT16 *)0x0000F130))
#define REG_TIMERD3_CMP2       (*((volatile UINT16 *)0x0000F131))
#define REG_TIMERD3_CAP        (*((volatile UINT16 *)0x0000F132))
#define REG_TIMERD3_LOAD       (*((volatile UINT16 *)0x0000F133))
#define REG_TIMERD3_HOLD       (*((volatile UINT16 *)0x0000F134))
#define REG_TIMERD3_CNTR       (*((volatile UINT16 *)0x0000F135))
#define REG_TIMERD3_CTRL       (*((volatile UINT16 *)0x0000F136))
#define REG_TIMERD3_SCR        (*((volatile UINT16 *)0x0000F137))
#define REG_TIMERD3_CMPLD1     (*((volatile UINT16 *)0x0000F138))
#define REG_TIMERD3_CMPLD2     (*((volatile UINT16 *)0x0000F139))
#define REG_TIMERD3_COMSCR     (*((volatile UINT16 *)0x0000F13A))
/* ************************** SIM  ********************************* */
#define REG_SIM_CONTROL        (*((volatile UINT16 *)0x0000F350))
#define REG_SIM_RSTSTS         (*((volatile UINT16 *)0x0000F351))
#define REG_SIM_SCR0           (*((volatile UINT16 *)0x0000F352))
#define REG_SIM_SCR1           (*((volatile UINT16 *)0x0000F353))
#define REG_SIM_SCR2           (*((volatile UINT16 *)0x0000F354))
#define REG_SIM_SCR3           (*((volatile UINT16 *)0x0000F355))
#define REG_SIM_SH_ID          (*((volatile UINT16 *)0x0000F356))
#define REG_SIM_LSH_ID         (*((volatile UINT16 *)0x0000F357))
#define REG_SIM_PUDR           (*((volatile UINT16 *)0x0000F358))
#define REG_SIM_CLKOSR         (*((volatile UINT16 *)0x0000F35A))
#define REG_SIM_GPS            (*((volatile UINT16 *)0x0000F35B))
#define REG_SIM_PCE            (*((volatile UINT16 *)0x0000F35C))
#define REG_SIM_ISALH          (*((volatile UINT16 *)0x0000F35D))
#define REG_SIM_ISALL          (*((volatile UINT16 *)0x0000F35E))
#define REG_SIM_PCE2           (*((volatile UINT16 *)0x0000F35F))
/* ************************** SCI0 ********************************* */
#define REG_SCI0_SCIBR         (*((volatile UINT16 *)0x0000F280))
#define REG_SCI0_SCICR         (*((volatile UINT16 *)0x0000F281))
#define REG_SCI0_SCISR         (*((volatile UINT16 *)0x0000F283))
#define REG_SCI0_SCIDR         (*((volatile UINT16 *)0x0000F284))
/* ************************** SCI1 ********************************* */
#define REG_SCI1_SCIBR         (*((volatile UINT16 *)0x0000F290))
#define REG_SCI1_SCICR         (*((volatile UINT16 *)0x0000F291))
#define REG_SCI1_SCISR         (*((volatile UINT16 *)0x0000F293))
#define REG_SCI1_SCIDR         (*((volatile UINT16 *)0x0000F294))
/* ************************** ITCN ********************************* */
#define REG_ITCN_IPR0          (*((volatile UINT16 *)0x0000F1A0))
#define REG_ITCN_IPR1          (*((volatile UINT16 *)0x0000F1A1))
#define REG_ITCN_IPR2          (*((volatile UINT16 *)0x0000F1A2))
#define REG_ITCN_IPR3          (*((volatile UINT16 *)0x0000F1A3))
#define REG_ITCN_IPR4          (*((volatile UINT16 *)0x0000F1A4))
#define REG_ITCN_IPR5          (*((volatile UINT16 *)0x0000F1A5))
#define REG_ITCN_IPR6          (*((volatile UINT16 *)0x0000F1A6))
#define REG_ITCN_IPR7          (*((volatile UINT16 *)0x0000F1A7))
#define REG_ITCN_IPR8          (*((volatile UINT16 *)0x0000F1A8))
#define REG_ITCN_IPR9          (*((volatile UINT16 *)0x0000F1A9))
#define REG_ITCN_VBA           (*((volatile UINT16 *)0x0000F1AA))
#define REG_ITCN_FIM0          (*((volatile UINT16 *)0x0000F1AB))
#define REG_ITCN_FIVAL0        (*((volatile UINT16 *)0x0000F1AC))
#define REG_ITCN_FIVAH0        (*((volatile UINT16 *)0x0000F1AD))
#define REG_ITCN_FIM1          (*((volatile UINT16 *)0x0000F1AE))
#define REG_ITCN_FIVAL1        (*((volatile UINT16 *)0x0000F1AF))
#define REG_ITCN_FIVAH1        (*((volatile UINT16 *)0x0000F1B0))
#define REG_ITCN_IRQP0         (*((volatile UINT16 *)0x0000F1B1))
#define REG_ITCN_IRQP1         (*((volatile UINT16 *)0x0000F1B2))
#define REG_ITCN_IRQP2         (*((volatile UINT16 *)0x0000F1B3))
#define REG_ITCN_IRQP3         (*((volatile UINT16 *)0x0000F1B4))
#define REG_ITCN_IRQP4         (*((volatile UINT16 *)0x0000F1B5))
#define REG_ITCN_IRQP5         (*((volatile UINT16 *)0x0000F1B6))
#define REG_ITCN_ICTL          (*((volatile UINT16 *)0x0000F1BD))
#define REG_ITCN_IPR10         (*((volatile UINT16 *)0x0000F1BF))
/* ************************** PWMA ********************************* */
#define REG_PWMA_PMCTL         (*((volatile UINT16 *)0x0000F140))
#define REG_PWMA_PMFCTL        (*((volatile UINT16 *)0x0000F141))
#define REG_PWMA_PMFSA         (*((volatile UINT16 *)0x0000F142))
#define REG_PWMA_PMOUT         (*((volatile UINT16 *)0x0000F143))
#define REG_PWMA_PMCNT         (*((volatile UINT16 *)0x0000F144))
#define REG_PWMA_PWMCM         (*((volatile UINT16 *)0x0000F145))
#define REG_PWMA_PWMVAL0       (*((volatile UINT16 *)0x0000F146))
#define REG_PWMA_PWMVAL1       (*((volatile UINT16 *)0x0000F147))
#define REG_PWMA_PWMVAL2       (*((volatile UINT16 *)0x0000F148))
#define REG_PWMA_PWMVAL3       (*((volatile UINT16 *)0x0000F149))
#define REG_PWMA_PWMVAL4       (*((volatile UINT16 *)0x0000F14A))
#define REG_PWMA_PWMVAL5       (*((volatile UINT16 *)0x0000F14B))
#define REG_PWMA_PMDEADTM      (*((volatile UINT16 *)0x0000F14C))
#define REG_PWMA_PMDISMAP1     (*((volatile UINT16 *)0x0000F14D))
#define REG_PWMA_PMDISMAP2     (*((volatile UINT16 *)0x0000F14E))
#define REG_PWMA_PMCFG         (*((volatile UINT16 *)0x0000F14F))
#define REG_PWMA_PMCCR         (*((volatile UINT16 *)0x0000F150))
#define REG_PWMA_PMPORT        (*((volatile UINT16 *)0x0000F151))
#define REG_PWMA_PMICCR        (*((volatile UINT16 *)0x0000F152))
/* ************************** PWMB ********************************* */
#define REG_PWMB_PMCTL         (*((volatile UINT16 *)0x0000F160))
#define REG_PWMB_PMFCTL        (*((volatile UINT16 *)0x0000F161))
#define REG_PWMB_PMFSA         (*((volatile UINT16 *)0x0000F162))
#define REG_PWMB_PMOUT         (*((volatile UINT16 *)0x0000F163))
#define REG_PWMB_PMCNT         (*((volatile UINT16 *)0x0000F164))
#define REG_PWMB_PWMCM         (*((volatile UINT16 *)0x0000F165))
#define REG_PWMB_PWMVAL0       (*((volatile UINT16 *)0x0000F166))
#define REG_PWMB_PWMVAL1       (*((volatile UINT16 *)0x0000F167))
#define REG_PWMB_PWMVAL2       (*((volatile UINT16 *)0x0000F168))
#define REG_PWMB_PWMVAL3       (*((volatile UINT16 *)0x0000F169))
#define REG_PWMB_PWMVAL4       (*((volatile UINT16 *)0x0000F16A))
#define REG_PWMB_PWMVAL5       (*((volatile UINT16 *)0x0000F16B))
#define REG_PWMB_PMDEADTM      (*((volatile UINT16 *)0x0000F16C))
#define REG_PWMB_PMDISMAP1     (*((volatile UINT16 *)0x0000F16D))
#define REG_PWMB_PMDISMAP2     (*((volatile UINT16 *)0x0000F16E))
#define REG_PWMB_PMCFG         (*((volatile UINT16 *)0x0000F16F))
#define REG_PWMB_PMCCR         (*((volatile UINT16 *)0x0000F170))
#define REG_PWMB_PMPORT        (*((volatile UINT16 *)0x0000F171))
#define REG_PWMB_PMICCR        (*((volatile UINT16 *)0x0000F172))
/* ************************** TIMERA0 ****************************** */
#define REG_TIMERA0_CMP1       (*((volatile UINT16 *)0x0000F040))
#define REG_TIMERA0_CMP2       (*((volatile UINT16 *)0x0000F041))
#define REG_TIMERA0_CAP        (*((volatile UINT16 *)0x0000F042))
#define REG_TIMERA0_LOAD       (*((volatile UINT16 *)0x0000F043))
#define REG_TIMERA0_HOLD       (*((volatile UINT16 *)0x0000F044))
#define REG_TIMERA0_CNTR       (*((volatile UINT16 *)0x0000F045))
#define REG_TIMERA0_CTRL       (*((volatile UINT16 *)0x0000F046))
#define REG_TIMERA0_SCR        (*((volatile UINT16 *)0x0000F047))
#define REG_TIMERA0_CMPLD1     (*((volatile UINT16 *)0x0000F048))
#define REG_TIMERA0_CMPLD2     (*((volatile UINT16 *)0x0000F049))
#define REG_TIMERA0_COMSCR     (*((volatile UINT16 *)0x0000F04A))
/* ************************** TIMERA1 ****************************** */
#define REG_TIMERA1_CMP1       (*((volatile UINT16 *)0x0000F050))
#define REG_TIMERA1_CMP2       (*((volatile UINT16 *)0x0000F051))
#define REG_TIMERA1_CAP        (*((volatile UINT16 *)0x0000F052))
#define REG_TIMERA1_LOAD       (*((volatile UINT16 *)0x0000F053))
#define REG_TIMERA1_HOLD       (*((volatile UINT16 *)0x0000F054))
#define REG_TIMERA1_CNTR       (*((volatile UINT16 *)0x0000F055))
#define REG_TIMERA1_CTRL       (*((volatile UINT16 *)0x0000F056))
#define REG_TIMERA1_SCR        (*((volatile UINT16 *)0x0000F057))
#define REG_TIMERA1_CMPLD1     (*((volatile UINT16 *)0x0000F058))
#define REG_TIMERA1_CMPLD2     (*((volatile UINT16 *)0x0000F059))
#define REG_TIMERA1_COMSCR     (*((volatile UINT16 *)0x0000F05A))
/* ************************** TIMERA2 ****************************** */
#define REG_TIMERA2_CMP1       (*((volatile UINT16 *)0x0000F060))
#define REG_TIMERA2_CMP2       (*((volatile UINT16 *)0x0000F061))
#define REG_TIMERA2_CAP        (*((volatile UINT16 *)0x0000F062))
#define REG_TIMERA2_LOAD       (*((volatile UINT16 *)0x0000F063))
#define REG_TIMERA2_HOLD       (*((volatile UINT16 *)0x0000F064))
#define REG_TIMERA2_CNTR       (*((volatile UINT16 *)0x0000F065))
#define REG_TIMERA2_CTRL       (*((volatile UINT16 *)0x0000F066))
#define REG_TIMERA2_SCR        (*((volatile UINT16 *)0x0000F067))
#define REG_TIMERA2_CMPLD1     (*((volatile UINT16 *)0x0000F068))
#define REG_TIMERA2_CMPLD2     (*((volatile UINT16 *)0x0000F069))
#define REG_TIMERA2_COMSCR     (*((volatile UINT16 *)0x0000F06A))
/* ************************** TIMERA3 ****************************** */
#define REG_TIMERA3_CMP1       (*((volatile UINT16 *)0x0000F070))
#define REG_TIMERA3_CMP2       (*((volatile UINT16 *)0x0000F071))
#define REG_TIMERA3_CAP        (*((volatile UINT16 *)0x0000F072))
#define REG_TIMERA3_LOAD       (*((volatile UINT16 *)0x0000F073))
#define REG_TIMERA3_HOLD       (*((volatile UINT16 *)0x0000F074))
#define REG_TIMERA3_CNTR       (*((volatile UINT16 *)0x0000F075))
#define REG_TIMERA3_CTRL       (*((volatile UINT16 *)0x0000F076))
#define REG_TIMERA3_SCR        (*((volatile UINT16 *)0x0000F077))
#define REG_TIMERA3_CMPLD1     (*((volatile UINT16 *)0x0000F078))
#define REG_TIMERA3_CMPLD2     (*((volatile UINT16 *)0x0000F079))
#define REG_TIMERA3_COMSCR     (*((volatile UINT16 *)0x0000F07A))
/* ***************************  OCCS ******************************* */
#define REG_OCCS_PLLCR         (*((volatile UINT16 *)0x0000F2D0))
#define REG_OCCS_PLLDB         (*((volatile UINT16 *)0x0000F2D1))
#define REG_OCCS_PLLSR         (*((volatile UINT16 *)0x0000F2D2))
#define REG_OCCS_SHUTDOWN      (*((volatile UINT16 *)0x0000F2D4))
#define REG_OCCS_OSCTL         (*((volatile UINT16 *)0x0000F2D5))
/* ***************************  GPIOA ****************************** */
#define REG_GPIOA_PUR          (*((volatile UINT16 *)0x0000F2E0))
#define REG_GPIOA_DR           (*((volatile UINT16 *)0x0000F2E1))
#define REG_GPIOA_DDR          (*((volatile UINT16 *)0x0000F2E2))
#define REG_GPIOA_PER          (*((volatile UINT16 *)0x0000F2E3))
#define REG_GPIOA_IAR          (*((volatile UINT16 *)0x0000F2E4))
#define REG_GPIOA_IENR         (*((volatile UINT16 *)0x0000F2E5))
#define REG_GPIOA_IPOLR        (*((volatile UINT16 *)0x0000F2E6))
#define REG_GPIOA_IPR          (*((volatile UINT16 *)0x0000F2E7))
#define REG_GPIOA_IESR         (*((volatile UINT16 *)0x0000F2E8))
#define REG_GPIOA_PPMODE       (*((volatile UINT16 *)0x0000F2E9))
#define REG_GPIOA_RAWDATA      (*((volatile UINT16 *)0x0000F2EA))
/* ***************************  GPIOB ****************************** */
#define REG_GPIOB_PUR          (*((volatile UINT16 *)0x0000F300))
#define REG_GPIOB_DR           (*((volatile UINT16 *)0x0000F301))
#define REG_GPIOB_DDR          (*((volatile UINT16 *)0x0000F302))
#define REG_GPIOB_PER          (*((volatile UINT16 *)0x0000F303))
#define REG_GPIOB_IAR          (*((volatile UINT16 *)0x0000F304))
#define REG_GPIOB_IENR         (*((volatile UINT16 *)0x0000F305))
#define REG_GPIOB_IPOLR        (*((volatile UINT16 *)0x0000F306))
#define REG_GPIOB_IPR          (*((volatile UINT16 *)0x0000F307))
#define REG_GPIOB_IESR         (*((volatile UINT16 *)0x0000F308))
#define REG_GPIOB_PPMODE       (*((volatile UINT16 *)0x0000F309))
#define REG_GPIOB_RAWDATA      (*((volatile UINT16 *)0x0000F30A))
/* ***************************  GPIOC ****************************** */
#define REG_GPIOC_PUR          (*((volatile UINT16 *)0x0000F310))
#define REG_GPIOC_DR           (*((volatile UINT16 *)0x0000F311))
#define REG_GPIOC_DDR          (*((volatile UINT16 *)0x0000F312))
#define REG_GPIOC_PER          (*((volatile UINT16 *)0x0000F313))
#define REG_GPIOC_IAR          (*((volatile UINT16 *)0x0000F314))
#define REG_GPIOC_IENR         (*((volatile UINT16 *)0x0000F315))
#define REG_GPIOC_IPOLR        (*((volatile UINT16 *)0x0000F316))
#define REG_GPIOC_IPR          (*((volatile UINT16 *)0x0000F317))
#define REG_GPIOC_IESR         (*((volatile UINT16 *)0x0000F318))
#define REG_GPIOC_PPMODE       (*((volatile UINT16 *)0x0000F319))
#define REG_GPIOC_RAWDATA      (*((volatile UINT16 *)0x0000F31A))
/* ***************************  GPIOD ****************************** */
#define REG_GPIOD_PUR          (*((volatile UINT16 *)0x0000F320))
#define REG_GPIOD_DR           (*((volatile UINT16 *)0x0000F321))
#define REG_GPIOD_DDR          (*((volatile UINT16 *)0x0000F322))
#define REG_GPIOD_PER          (*((volatile UINT16 *)0x0000F323))
#define REG_GPIOD_IAR          (*((volatile UINT16 *)0x0000F324))
#define REG_GPIOD_IENR         (*((volatile UINT16 *)0x0000F325))
#define REG_GPIOD_IPOLR        (*((volatile UINT16 *)0x0000F326))
#define REG_GPIOD_IPR          (*((volatile UINT16 *)0x0000F327))
#define REG_GPIOD_IESR         (*((volatile UINT16 *)0x0000F328))
#define REG_GPIOD_PPMODE       (*((volatile UINT16 *)0x0000F329))
#define REG_GPIOD_RAWDATA      (*((volatile UINT16 *)0x0000F32A))
/* ***************************  GPIOE ****************************** */
#define REG_GPIOE_PUR          (*((volatile UINT16 *)0x0000F330))
#define REG_GPIOE_DR           (*((volatile UINT16 *)0x0000F331))
#define REG_GPIOE_DDR          (*((volatile UINT16 *)0x0000F332))
#define REG_GPIOE_PER          (*((volatile UINT16 *)0x0000F333))
#define REG_GPIOE_IAR          (*((volatile UINT16 *)0x0000F334))
#define REG_GPIOE_IENR         (*((volatile UINT16 *)0x0000F335))
#define REG_GPIOE_IPOLR        (*((volatile UINT16 *)0x0000F336))
#define REG_GPIOE_IPR          (*((volatile UINT16 *)0x0000F337))
#define REG_GPIOE_IESR         (*((volatile UINT16 *)0x0000F338))
#define REG_GPIOE_PPMODE       (*((volatile UINT16 *)0x0000F339))
#define REG_GPIOE_RAWDATA      (*((volatile UINT16 *)0x0000F33A))
/* ***************************  GPIOF ****************************** */
#define REG_GPIOF_PUR          (*((volatile UINT16 *)0x0000F340))
#define REG_GPIOF_DR           (*((volatile UINT16 *)0x0000F341))
#define REG_GPIOF_DDR          (*((volatile UINT16 *)0x0000F342))
#define REG_GPIOF_PER          (*((volatile UINT16 *)0x0000F343))
#define REG_GPIOF_IAR          (*((volatile UINT16 *)0x0000F344))
#define REG_GPIOF_IENR         (*((volatile UINT16 *)0x0000F345))
#define REG_GPIOF_IPOLR        (*((volatile UINT16 *)0x0000F346))
#define REG_GPIOF_IPR          (*((volatile UINT16 *)0x0000F347))
#define REG_GPIOF_IESR         (*((volatile UINT16 *)0x0000F348))
#define REG_GPIOF_PPMODE       (*((volatile UINT16 *)0x0000F349))
#define REG_GPIOF_RAWDATA      (*((volatile UINT16 *)0x0000F34A))
/* ***************************  TSENSOR **************************** */
#define REG_TSENSOR_CTRL       (*((volatile UINT16 *)0x0000F270))
/* ***************************   COP     *************************** */
#define REG_COP_COPCTL         (*((volatile UINT16 *)0x0000F2C0))
#define REG_COP_COPTO          (*((volatile UINT16 *)0x0000F2C1))
#define REG_COP_COPCTR         (*((volatile UINT16 *)0x0000F2C2))
/* ************************** TIMERB0 ****************************** */
#define REG_TIMERB0_CMP1       (*((volatile UINT16 *)0x0000F080))
#define REG_TIMERB0_CMP2       (*((volatile UINT16 *)0x0000F081))
#define REG_TIMERB0_CAP        (*((volatile UINT16 *)0x0000F082))
#define REG_TIMERB0_LOAD       (*((volatile UINT16 *)0x0000F083))
#define REG_TIMERB0_HOLD       (*((volatile UINT16 *)0x0000F084))
#define REG_TIMERB0_CNTR       (*((volatile UINT16 *)0x0000F085))
#define REG_TIMERB0_CTRL       (*((volatile UINT16 *)0x0000F086))
#define REG_TIMERB0_SCR        (*((volatile UINT16 *)0x0000F087))
#define REG_TIMERB0_CMPLD1     (*((volatile UINT16 *)0x0000F088))
#define REG_TIMERB0_CMPLD2     (*((volatile UINT16 *)0x0000F089))
#define REG_TIMERB0_COMSCR     (*((volatile UINT16 *)0x0000F08A))
/* ************************** TIMERB1 ****************************** */
#define REG_TIMERB1_CMP1       (*((volatile UINT16 *)0x0000F090))
#define REG_TIMERB1_CMP2       (*((volatile UINT16 *)0x0000F091))
#define REG_TIMERB1_CAP        (*((volatile UINT16 *)0x0000F092))
#define REG_TIMERB1_LOAD       (*((volatile UINT16 *)0x0000F093))
#define REG_TIMERB1_HOLD       (*((volatile UINT16 *)0x0000F094))
#define REG_TIMERB1_CNTR       (*((volatile UINT16 *)0x0000F095))
#define REG_TIMERB1_CTRL       (*((volatile UINT16 *)0x0000F096))
#define REG_TIMERB1_SCR        (*((volatile UINT16 *)0x0000F097))
#define REG_TIMERB1_CMPLD1     (*((volatile UINT16 *)0x0000F098))
#define REG_TIMERB1_CMPLD2     (*((volatile UINT16 *)0x0000F099))
#define REG_TIMERB1_COMSCR     (*((volatile UINT16 *)0x0000F09A))
/* ************************** TIMERB2 ****************************** */
#define REG_TIMERB2_CMP1       (*((volatile UINT16 *)0x0000F0A0))
#define REG_TIMERB2_CMP2       (*((volatile UINT16 *)0x0000F0A1))
#define REG_TIMERB2_CAP        (*((volatile UINT16 *)0x0000F0A2))
#define REG_TIMERB2_LOAD       (*((volatile UINT16 *)0x0000F0A3))
#define REG_TIMERB2_HOLD       (*((volatile UINT16 *)0x0000F0A4))
#define REG_TIMERB2_CNTR       (*((volatile UINT16 *)0x0000F0A5))
#define REG_TIMERB2_CTRL       (*((volatile UINT16 *)0x0000F0A6))
#define REG_TIMERB2_SCR        (*((volatile UINT16 *)0x0000F0A7))
#define REG_TIMERB2_CMPLD1     (*((volatile UINT16 *)0x0000F0A8))
#define REG_TIMERB2_CMPLD2     (*((volatile UINT16 *)0x0000F0A9))
#define REG_TIMERB2_COMSCR     (*((volatile UINT16 *)0x0000F0AA))
/* ************************** TIMERB3 ****************************** */
#define REG_TIMERB3_CMP1       (*((volatile UINT16 *)0x0000F0B0))
#define REG_TIMERB3_CMP2       (*((volatile UINT16 *)0x0000F0B1))
#define REG_TIMERB3_CAP        (*((volatile UINT16 *)0x0000F0B2))
#define REG_TIMERB3_LOAD       (*((volatile UINT16 *)0x0000F0B3))
#define REG_TIMERB3_HOLD       (*((volatile UINT16 *)0x0000F0B4))
#define REG_TIMERB3_CNTR       (*((volatile UINT16 *)0x0000F0B5))
#define REG_TIMERB3_CTRL       (*((volatile UINT16 *)0x0000F0B6))
#define REG_TIMERB3_SCR        (*((volatile UINT16 *)0x0000F0B7))
#define REG_TIMERB3_CMPLD1     (*((volatile UINT16 *)0x0000F0B8))
#define REG_TIMERB3_CMPLD2     (*((volatile UINT16 *)0x0000F0B9))
#define REG_TIMERB3_COMSCR     (*((volatile UINT16 *)0x0000F0BA))
